# -*- coding: utf-8 -*-
"""
Задание 15.1a

Напишите регулярное выражение, которое отобразит строки
с интерфейсами 0/1 и 0/3 из вывода sh ip int br.

Проверьте регулярное выражение, используя скрипт, который был создан в задании 15.1,
и файл sh_ip_int_br.txt.

В этом файле нужно написать только регулярное выражение.

"""

from sys import argv
import re

regex = "\S0/[1|3] +"   # \S - всё, кроме пробелов. затели либо 0/1, либо 0/3

file = argv[1]  # передаем в скрипт название файла

with open(file) as f:
    for line in f:
        match = re.search(regex, line)  # ищем совпадения регулярки, введёной ранее
        if match:       # если совпадает, то print
            print(line.strip())
