"""
Преобразовать IP-адрес (переменная IP) в двоичный формат и вывести вывод
столбцами на стандартный поток вывода, таким образом:
    первой строкой должны идти десятичные значения байтовю
    второй строкой двоичные значения.
Вывод должен быть упорядочен также, как в примере:
столбцами
ширина столбца 10 символов
Пример вывода:

10       1        1        1
00001010 00000001 00000001 00000001

"""

IP = '192.168.3.1'
IP = IP.split('.')  #разделитель точка

first = int(IP[0])
second = int(IP[1])
third = int(IP[2])
fourth = int(IP[3])

#шаблончик
result = """
{A:<10}{B:<10}{C:<10}{D:<10}
{A:08b}  {B:08b}  {C:08b}  {D:08b}  
"""
print(result.format(A = first,B = second,C = third,D = fourth))


