# -*- coding: utf-8 -*-
'''
Задание 9.4

Создать функцию, которая обрабатывает конфигурационный файл коммутатора
и возвращает словарь:
* Все команды верхнего уровня (глобального режима конфигурации), будут ключами.
* Если у команды верхнего уровня есть подкоманды, они должны быть в значении у соответствующего ключа, в виде списка (пробелы в начале строки можно оставлять).
* Если у команды верхнего уровня нет подкоманд, то значение будет пустым списком

Функция ожидает в качестве аргумента имя конфигурационного файла.

Проверить работу функции на примере файла config_sw1.txt

При обработке конфигурационного файла, надо игнорировать строки, которые начинаются с '!',
а также строки в которых содержатся слова из списка ignore.

Для проверки надо ли игнорировать строку, использовать функцию ignore_command.


Ограничение: Все задания надо выполнять используя только пройденные темы.
'''

from pprint import pprint

ignore = ['duplex', 'alias', 'Current configuration']


def ignore_command(command, ignore):
    '''
    Функция проверяет содержится ли в команде слово из списка ignore.

    command - строка. Команда, которую надо проверить
    ignore - список. Список слов

    Возвращает
    * True, если в команде содержится слово из списка ignore
    * False - если нет
    '''
    return any(word in command for word in ignore)

def config(open_cfg):
    with open(open_cfg) as src:
        result = {}
        for line in src:
            if ignore_command(command=line, ignore=ignore) or line.startswith('!'): # если это есть, то продолжаем
                continue
            if not line.startswith(' '):    # если не содержит проблем в начале строки, то
                key = line.strip()  # ключ - строка, в которой убраны whitespace-символы
                result[key] = []    # закидываем в словарь ключ с пустным значением
            else:
                result[key].append(line.strip())    # иначе строка является значением.

    return result

pprint(config('config_sw1.txt'))


