#!/usr/bin/env python3
"""
Найти индекс последнего вхождения элемента.
Например, для списка num_list, число 10 последний раз встречается с индексом 4; в
списке word_list, слово 'ruby' последний раз встречается с индексом 6.
Сделать решение общим (то есть, не привязываться к конкретному элементу в
конкретном списке) и проверить на двух списках, которые указаны и на разных
элементах.
Для этого надо запросить у пользователя сначала ввод числа из списка num_list и
затем вывести индекс его последнего появления в списке. А затем аналогично для
списка word_list.
"""

num_list = [10, 2, 30, 100, 10, 50, 11, 30, 15, 7]
word_list = ['python', 'ruby', 'perl', 'ruby', 'perl', 'python', 'ruby', 'perl']

num_reverse = num_list[::-1]
word_reverse = word_list[::-1]

num_reseult = num_reverse.index(int(input('Введите число из списка:')))
word_reseult = word_reverse.index(str(input('Введите слово из списка:')))

print(num_reseult, word_reseult)